#include <drive_delay.h>
#include <bsp_delay.h>
#include "FreeRTOS.h"
#include "timers.h"

/**********************************************************************************************************
*函 数 名: Delay_US
*功能说明: 此延时函数不会引起任务调度
*形    参: 延迟时间US
*返 回 值: 无
**********************************************************************************************************/
void Delay_US(uint32_t us)
{
    uint32_t tCnt, tDelayCnt;
	uint32_t tStart;
		
	tStart = DWT_CYCCNT;
	tCnt = 0;
	tDelayCnt = us * (SystemCoreClock / 1000000);	 		      

	while(tCnt < tDelayCnt)
	{
		tCnt = DWT_CYCCNT - tStart; 
	}
}

/**********************************************************************************************************
*函 数 名: Delay_MS
*功能说明: 此延时函数不会引起任务调度
*形    参: 延迟时间ms
*返 回 值: 无
**********************************************************************************************************/
void Delay_MS(uint32_t ms)
{
	Delay_US(1000*ms);
}



/**********************************************************************************************************
*函 数 名: GetSysTimeUs
*功能说明: 获取当前系统运行时间，单位为微秒
*形    参: 无
*返 回 值: 系统时间
**********************************************************************************************************/
uint64_t Get_SysTimeUs(void)
{
    uint64_t ms;
    uint64_t value;
    ms = xTaskGetTickCount();
    value = ms * 1000 + (SysTick->LOAD - SysTick->VAL) * 1000 / SysTick->LOAD;
    return value;
}

/**********************************************************************************************************
*函 数 名: GetSysTimeMs
*功能说明: 获取当前系统运行时间，单位为毫秒
*形    参: 无
*返 回 值: 系统时间
**********************************************************************************************************/
uint32_t Get_SysTimeMs(void)
{
    return xTaskGetTickCount();
}



