#include <math_tool.h>

/**********************************************************************************************************
*函 数 名: constrainFloat
*功能说明: 浮点型限幅
*形    参: 输入值 限幅下限 限幅上限
*返 回 值: 限幅后的值
**********************************************************************************************************/
float ConstrainFloat(float amt, float low, float high)
{
    if (isnan(amt))
    {
        return (low+high)*0.5f;
    }
    return ((amt)<(low)?(low):((amt)>(high)?(high):(amt)));
}

/**********************************************************************************************************
*函 数 名: ApplyDeadbandFloat
*功能说明: 误差死区控制
*形    参: 输入值 死区
*返 回 值: 误差值
**********************************************************************************************************/

float ApplyDeadbandFloat(float value, float deadband)
{
    if (abs(value) < deadband)
        value = 0;
    return value;
}

/**********************************************************************************************************
*函 数 名: ApplyDeadbandFloat
*功能说明: 误差死区控制
*形    参: 输入值 死区
*返 回 值: 误差值
**********************************************************************************************************/

int32_t ApplyDeadbandInt(int32_t value, int32_t deadband)
{
    if (abs(value) < deadband)
        value = 0;
    return value;
}




/**********************************************************************************************************
*函 数 名: Radians
*功能说明: 角度转弧度
*形    参: 角度值
*返 回 值: 弧度值
**********************************************************************************************************/
float Radians(float deg)
{
    return deg * DEG_TO_RAD;
}

/**********************************************************************************************************
*函 数 名: Radians
*功能说明: 弧度转角度
*形    参: 弧度值
*返 回 值: 角度值
**********************************************************************************************************/
float Degrees(float rad)
{
    return rad * RAD_TO_DEG;
}




